import sqlite3
from datetime import time

# con = sqlite3.connect("../instance/database.db")
con = sqlite3.connect("instance/database.db")
cur = con.cursor()

courses = [
    (
        1,
        "1428",
        "作業系統",
        "陳烈武",
        "資電104",
        "四",
        "6,7",
        3,
        4,
    ),
    (
        2,
        "1430",
        "微處理機實習",
        "王益文",
        "資電234",
        "一",
        "2,3,4",
        1,
        2,
    ),
    (
        3,
        "1429",
        "微處理機",
        "王益文",
        "資電404",
        "一",
        "7,8",
        3,
        2,
    ),
    (
        4,
        "1432",
        "軟體工程",
        "許懷中",
        "資電330",
        "三",
        "6,7,8",
        3,
        3,
    ),
    (
        5,
        "1434",
        "資料科學實務",
        "許懷中",
        "紀207",
        "二",
        "3,4",
        3,
        1,
    ),
    (
        6,
        "1435",
        "數位影像處理",
        "蔡明翰",
        "忠B05",
        "四",
        "2,3,4",
        3,
        2,
    ),
    (
        7,
        "1431",
        "軟體測試",
        "薛念林",
        "行204",
        "三",
        "6,7,8",
        3,
        3,
    ),
    (
        8,
        "3151",
        "視覺設計原理與技巧",
        "謝欣錦",
        "行政二館105-電腦實習室",
        "五",
        "9,10",
        2,
        2,
    ),
    (
        9,
        "2994",
        "日文(三)",
        "張又華",
        "商103",
        "五",
        "3,4",
        2,
        1,
    ),
    (
        10,
        "3725",
        "資安韌性與社會實踐",
        "周澤捷,李榮三",
        "資電102",
        "六",
        "2,3,4",
        3,
        1,
    ),
    (
        11,
        "1433",
        "資料探勘導論",
        "李俊宏",
        "資電330",
        "四",
        "2,3,4",
        3,
        2,
    ),
    (
        12,
        "3626",
        "網路程式設計",
        "陳烈武",
        "行205",
        "二",
        "6,7",
        2,
        4,
    ),
    (
        13,
        "3627",
        "網路程式設計實習",
        "陳烈武",
        "資電234(電腦實習室)",
        "四",
        "9,10",
        1,
        4,
    ),
]
cur.executemany(
    "INSERT INTO courses VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)", courses
)

# enrollments = [
#     ( 1, 1),
#     ( 1, 2),
#     ( 2, 3),
#     ( 3, 4),
#     ( 3, 5),
# ]
# cur.executemany(
#     "INSERT INTO enrollments (student_id, class_id) VALUES (?, ?)", enrollments
# )

# follow = [
#     ( 1, 1),
#     ( 1, 2),
#     ( 2, 3),
#     ( 3, 4),
#     ( 3, 5),
# ]
# cur.executemany(
#     "INSERT INTO follow (student_id, class_id) VALUES (?, ?)", follow
# )

con.commit()
